tap "d12frosted/emacs-plus"
tap "homebrew/services"
tap "nikitabobko/tap"
# Core application library for C
brew "glib"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# Code searching, linting, rewriting
brew "ast-grep"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Python code formatter
brew "black", link: false
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# CloudFlare's PKI toolkit
brew "cfssl"
# Copy files from your terminal that actually paste into GUI apps
brew "clippy"
# Cross-platform make
brew "cmake"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Program that can automate interactive applications
brew "expect"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GitHub Model Context Protocol server for AI tools
brew "github-mcp-server"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Fast and user friendly build system
brew "meson"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Incremental parsing library
brew "tree-sitter"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Monitor data's progress through a pipe
brew "pv"
# Generic machine emulator and virtualizer
brew "qemu", link: false
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Non-interactive SSH password auth
brew "sshpass"
# Terminal multiplexer
brew "tmux"
# Parser generator tool
brew "tree-sitter-cli"
# Tool for creating isolated virtual python environments
brew "virtualenv", link: false
# Executes a program periodically, showing output fullscreen
brew "watch"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@30"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
cask "font-fantasque-sans-mono"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Menu bar manager
cask "jordanbaird-ice"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Archive manager for data compression and backups
cask "rar"
# System monitor for the menu bar
cask "stats"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@21"
# Development environment
cask "vagrant"
cargo "eza"
cargo "uv"
uv "mcp-atlassian"
uv "ruff"
uv "schemathesis"
npm "@earendil-works/pi-coding-agent"
npm "@github/copilot"
npm "@mermaid-js/mermaid-cli"
npm "corepack"
npm "glimpseui"
npm "pi-acp"
